In [1]:
import pandas as pd

data = {'Name': ['John', 'Alice', 'Bob'],
        'Math': [80, 75, 90],
        'Science': [85, 70, 88]}
df = pd.DataFrame(data)

df

    Name  Math  Science
0   John    80       85
1  Alice    75       70
2    Bob    90       88

In [5]:
melted_df = pd.melt(df, id_vars='Name', var_name='Subject', value_name='Score')

melted_df

pd.melt(df)

'''melt() introduces 2 new columns: variable and value
variable: holds the columns of the df
value: holds the values

'''

  variable  value
0     Name   John
1     Name  Alice
2     Name    Bob
3     Math     80
4     Math     75
5     Math     90
6  Science     85
7  Science     70
8  Science     88

Messy data: Columns are values instead of variable names

Melting/reshaping: Turning columns into rows

Melting/reshaping introduces 2 new variables: variable and value

identifier variables: Columns that stay unchanged

measured variables: Columns that change into rows